app/views/statuses/_form.html.erb


  <%= f.input :user_id,  collection: User.all, label_method: :nombre_completo %>
---
SELECT "users".* FROM "users"