app/controllers/perfil_controller.rb

SELECT "users".* FROM "users" WHERE "users"."nombre_perfil" = 'oja' LIMIT 1
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ?  [["user_id", 8]]
---
  def show

  	@user = User.find_by_nombre_perfil(params[:id])
  	if @user
  		@statuses = @user.statuses.all