app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("contenido", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["contenido", "Bienvenido a Ojalabook!"], ["created_at", Tue, 06 May 2014 14:43:54 UTC +00:00], ["updated_at", Tue, 06 May 2014 14:43:54 UTC +00:00], ["user_id", 6]]

  def destroy
    @status.destroy
---
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 3]]

    def set_status
      @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "5"]]